[LWS_Keeper X2SoldierClassTemplate]
DisplayName="Keeper"
ClassSummary="Keepers are experts in the field of military logistics. They keep their allies supplied and lock down their enemies with defensive tactics and rapid reaction fire."
LeftAbilityTreeTitle="Overseer"
RightAbilityTreeTitle="No Eye In Team"
AbilityTreeTitles[0]="Overseer"
AbilityTreeTitles[1]="Endless"
AbilityTreeTitles[2]="No Eye In Team"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistols"

[IRI_GrappleGun X2AbilityTemplate]
LocFriendlyName="Grapple Gun"
LocLongDescription="The <Ability:ClassName/> can use a Grapple Gun to quickly move to an elevated position or to retrieve loot from the battlefield."
LocHelpText="Use a Grapple Gun to quickly move to an elevated position."
LocPromotionPopupText=""
LocFlyOverText="Grapple Gun"

[IRI_ResupplyAmmo X2AbilityTemplate]
LocFriendlyName="Resupply Ammo"
LocLongDescription="Reload the primary weapon of a targeted allied unit. If this unit is equipped with special Ammo, its effects will be applied to the reloaded weapon until its next regular reload. <Ability:ResupplyAmmoCooldown/> turn cooldown."
LocHelpText="Reload the primary weapon of a targeted allied unit. If equipped with special Ammo, its effects will be applied to the reloaded weapon until its next regular reload."
LocPromotionPopupText="If the target soldier already carries special Ammo, its effects will be temporarily overridden by Keeper's special Ammo."
LocFlyOverText="Resupply Ammo"

[IRI_SupplyRun X2AbilityTemplate]
LocFriendlyName="Supply Run"
LocLongDescription="Using Resupply Ammo or Bandage Throw on an ally grants a Move-only action point."
LocHelpText="Using Resupply Ammo or Bandage Throw on an ally grants a Move-only action point."
LocPromotionPopupText="The movement action point applies to the user of the ability, not the target."
LocFlyOverText="Supply Run"